nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx937/common/pin_mux/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMX9375xxxxx
package_id: MIMX9375xxVZx
mcu_data: ksdk2_0
processor_version: 0.2603.90
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {                                /*!< Function assigned for the core: Cortex-M7F[cm7] */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm7}
- pin_list:
  - {pin_num: N51, peripheral: LPUART3, signal: lpuart_tx, pin_signal: GPIO_IO14, DSE: DSE_0011_11}
  - {pin_num: P44, peripheral: LPUART3, signal: lpuart_rx, pin_signal: GPIO_IO15, DSE: DSE_0011_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void) {                      /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__LPUART3_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO14__LPUART3_TX, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__LPUART3_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO15__LPUART3_RX, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitNETPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: AG33, peripheral: ETH0, signal: 'eth_rgmii_td, 0', pin_signal: ENET1_TD0, PD: DISABLED}
  - {pin_num: AG35, peripheral: ETH0, signal: 'eth_rgmii_td, 1', pin_signal: ENET1_TD1, PD: DISABLED}
  - {pin_num: AF36, peripheral: ETH0, signal: 'eth_rgmii_td, 2', pin_signal: ENET1_TD2, PD: DISABLED}
  - {pin_num: AG37, peripheral: ETH0, signal: 'eth_rgmii_td, 3', pin_signal: ENET1_TD3, PD: DISABLED}
  - {pin_num: AG31, peripheral: ETH0, signal: eth_rgmii_tx_clk, pin_signal: ENET1_TXC, PD: DISABLED}
  - {pin_num: AF32, peripheral: ETH0, signal: eth_rgmii_tx_ctl, pin_signal: ENET1_TX_CTL, PD: DISABLED}
  - {pin_num: AJ33, peripheral: ETH0, signal: eth_rgmii_rx_clk, pin_signal: ENET1_RXC, PD: DISABLED}
  - {pin_num: AH34, peripheral: ETH0, signal: eth_rgmii_rx_ctl, pin_signal: ENET1_RX_CTL, PD: DISABLED}
  - {pin_num: AJ35, peripheral: ETH0, signal: 'eth_rgmii_rd, 0', pin_signal: ENET1_RD0, PD: DISABLED}
  - {pin_num: AK36, peripheral: ETH0, signal: 'eth_rgmii_rd, 1', pin_signal: ENET1_RD1, PD: DISABLED}
  - {pin_num: AJ37, peripheral: ETH0, signal: 'eth_rgmii_rd, 2', pin_signal: ENET1_RD2, PD: DISABLED}
  - {pin_num: AH38, peripheral: ETH0, signal: 'eth_rgmii_rd, 3', pin_signal: ENET1_RD3, PD: DISABLED}
  - {peripheral: NETC, signal: netc_mdc, pin_signal: ENET2_MDC, PD: DISABLED}
  - {peripheral: NETC, signal: netc_mdio, pin_signal: ENET2_MDIO, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_rd, 0', pin_signal: ENET2_RD0, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_rd, 1', pin_signal: ENET2_RD1, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_rd, 2', pin_signal: ENET2_RD2, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_rd, 3', pin_signal: ENET2_RD3, PD: DISABLED}
  - {peripheral: ETH1, signal: eth_rgmii_rx_clk, pin_signal: ENET2_RXC, PD: DISABLED}
  - {peripheral: ETH1, signal: eth_rgmii_rx_ctl, pin_signal: ENET2_RX_CTL, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_td, 0', pin_signal: ENET2_TD0, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_td, 1', pin_signal: ENET2_TD1, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_td, 2', pin_signal: ENET2_TD2, PD: DISABLED}
  - {peripheral: ETH1, signal: 'eth_rgmii_td, 3', pin_signal: ENET2_TD3, PD: DISABLED}
  - {peripheral: ETH1, signal: eth_rgmii_tx_clk, pin_signal: ENET2_TXC, PD: DISABLED}
  - {peripheral: ETH1, signal: eth_rgmii_tx_ctl, pin_signal: ENET2_TX_CTL, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

