nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx937/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitNETPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitNETPins(void) {                             /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD0__ETH0_RGMII_RD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD0__ETH0_RGMII_RD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD1__ETH0_RGMII_RD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD1__ETH0_RGMII_RD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD2__ETH0_RGMII_RD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD2__ETH0_RGMII_RD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RD3__ETH0_RGMII_RD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RD3__ETH0_RGMII_RD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RXC__ETH0_RGMII_RX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RXC__ETH0_RGMII_RX_CLK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_RX_CTL__ETH0_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_RX_CTL__ETH0_RGMII_RX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD0__ETH0_RGMII_TD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD0__ETH0_RGMII_TD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD1__ETH0_RGMII_TD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD1__ETH0_RGMII_TD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD2__ETH0_RGMII_TD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD2__ETH0_RGMII_TD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TD3__ETH0_RGMII_TD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TD3__ETH0_RGMII_TD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TXC__ETH0_RGMII_TX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TXC__ETH0_RGMII_TX_CLK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET1_TX_CTL__ETH0_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET1_TX_CTL__ETH0_RGMII_TX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_MDC__NETC_MDC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_MDC__NETC_MDC, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_MDIO__NETC_MDIO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_MDIO__NETC_MDIO, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD0__ETH1_RGMII_RD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD0__ETH1_RGMII_RD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD1__ETH1_RGMII_RD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD1__ETH1_RGMII_RD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD2__ETH1_RGMII_RD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD2__ETH1_RGMII_RD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RD3__ETH1_RGMII_RD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RD3__ETH1_RGMII_RD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RXC__ETH1_RGMII_RX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RXC__ETH1_RGMII_RX_CLK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_RX_CTL__ETH1_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_RX_CTL__ETH1_RGMII_RX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD0__ETH1_RGMII_TD0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD0__ETH1_RGMII_TD0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD1__ETH1_RGMII_TD1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD1__ETH1_RGMII_TD1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD2__ETH1_RGMII_TD2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD2__ETH1_RGMII_TD2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TD3__ETH1_RGMII_TD3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TD3__ETH1_RGMII_TD3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TXC__ETH1_RGMII_TX_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TXC__ETH1_RGMII_TX_CLK, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_ENET2_TX_CTL__ETH1_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ENET2_TX_CTL__ETH1_RGMII_TX_CTL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}


