nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimx937/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C3Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2C3Pins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO00__LPI2C3_SDA, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO01__LPI2C3_SCL, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCLKOPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {peripheral: CCM, signal: clko_2, pin_signal: CCM_CLKO2, PU: ENABLED}
  - {peripheral: CCM, signal: clko_2, pin_signal: CCM_CLKO2, PU: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCLKOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCLKOPins(void) {                            /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_CCM_CLKO2__CLKO_2, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_CCM_CLKO2__CLKO_2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PU_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIOPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: K48, peripheral: FLEXIO1, signal: 'flexio_flexio_, 2', pin_signal: GPIO_IO02, SION: ENABLED, OD: DISABLED, PD: DISABLED}
  - {pin_num: K52, peripheral: FLEXIO1, signal: 'flexio_flexio_, 3', pin_signal: GPIO_IO03, SION: ENABLED, PD: DISABLED}
  - {peripheral: FLEXIO1, signal: 'flexio_flexio_bit, 0', pin_signal: GPIO_IO00, SION: ENABLED, OD: ENABLED, PD: DISABLED}
  - {peripheral: FLEXIO1, signal: 'flexio_flexio_bit, 1', pin_signal: GPIO_IO01, SION: ENABLED, OD: ENABLED, PD: DISABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIOPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIOPins(void) {                          /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO_2, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO02__FLEXIO1_FLEXIO_2, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO_3, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__FLEXIO1_FLEXIO_3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO00__FLEXIO1_FLEXIO_0, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO00__FLEXIO1_FLEXIO_0, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PU_MASK |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO01__FLEXIO1_FLEXIO_1, 1U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO01__FLEXIO1_FLEXIO_1, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PU_MASK |
                        IOMUXC_PAD_OD_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3CPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitGPIO2Pins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: V44, peripheral: GPIO2, signal: 'gpio_io_, 29', pin_signal: GPIO_IO29, PD: DISABLED}
  - {pin_num: K52, peripheral: GPIO2, signal: 'gpio_io_, 3', pin_signal: GPIO_IO03, PD: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitGPIO2Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPIO2Pins(void) {                           /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO03__GPIO2_IO_3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO03__GPIO2_IO_3, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO29__GPIO2_IO_29, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO29__GPIO2_IO_29, 
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U));
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_DeInitDEBUG_UARTPins:
- options: {callFromInitBoot: 'false', coreID: cm7}
- pin_list:
  - {pin_num: N51, peripheral: GPIO2, signal: 'gpio_io_, 14', pin_signal: GPIO_IO14}
  - {pin_num: P44, peripheral: GPIO2, signal: 'gpio_io_, 15', pin_signal: GPIO_IO15}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeInitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_DeInitDEBUG_UARTPins(void) {                    /*!< Function assigned for the core: Cortex-M7F[cm7] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__GPIO2_IO_14, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__GPIO2_IO_15, 0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
